In [1]:
import pandas as pd

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
pd.Series([4, 8, 15, 16, 23, 42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
lst = list(range(23,34))

pd.Series(lst)

0     23
1     24
2     25
3     26
4     27
5     28
6     29
7     30
8     31
9     32
10    33
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

|  Name  | Age | gender  |
| :----: | :-: | :-----: |
| Alice  | 25  | Feamale |
|  Bob   | 30  |  Male   |
| Claire | 27  | Feamale |

Then, print the DataFrame.

In [4]:
d = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

pd.DataFrame(d)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

> `pd.Series` is a one-dimensional object in pandas which contains can hold homogeneous data type objects in it.

> `pd.DataFrame` is a two-dimensional object in pandas which can hold multiple series at a time and manupulate its data.

In [5]:
# Pandas Series

series = pd.Series([5, 34, 45, 242, 45, 12, 1, 0, 214, 45])

df = pd.DataFrame({
    'Name': ['Anshul', 'Raj', 'Prateek', 'Ashu'],
    'Age': [18, 16, 28, 28]
})

print(series)
df

0      5
1     34
2     45
3    242
4     45
5     12
6      1
7      0
8    214
9     45
dtype: int64

      Name  Age
0   Anshul   18
1      Raj   16
2  Prateek   28
3     Ashu   28

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

##### Some common functions in pandas dataframe are 

1. `pd.DataFrame.describe()` is used to see the summary of the numerical columns in the dataframe.
2. `pd.DataFrame.shape` gives the dimension of the dataset.
3. `pd.DataFrame.applymap()` takes a function as an argument which mainuplate the data of DataFrame and then returns the DataFrame.

In [6]:
print(df.shape)
df.describe()

(4, 2)

             Age
count   4.000000
mean   22.500000
std     6.403124
min    16.000000
25%    17.500000
50%    23.000000
75%    28.000000
max    28.000000

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?


> `Series` – 1D labeled homogeneous array, size is immutable.

> `DataFrame` – 2D labeled, size-mutable tabular structure with heterogenic columns.

> `Panel` – 3D labeled size mutable array.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [7]:
artist_name = pd.Series([
    'Anuv Jain',
    'Ashu Shukla',
    'Anumita Nandesan',
    'Akanksha Sethi'])

songs = pd.Series([
    'Alag Aasmaan',
    'Tumhare Aane Se',
    'Khwaab',
    'Thoda Sa Teher',
])

df = pd.DataFrame({
    'Artist Name': artist_name,
    'Song Name': songs
})

In [8]:
df

        Artist Name        Song Name
0         Anuv Jain     Alag Aasmaan
1       Ashu Shukla  Tumhare Aane Se
2  Anumita Nandesan           Khwaab
3    Akanksha Sethi   Thoda Sa Teher